Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: When you define an object in GameMaker you can assign it a mask to be used for collisions rather than the one that corresponds to the defined sprite.
zh_cn: 当你在GameMaker中定义一个对象时，你可以为它分配一个用于碰撞的掩码，而不是与所定义的精灵相对应的掩码。

source: When you destroy a layer in this way, all it's contents will be removed too, so any reference IDs for backgrounds or tile maps, etc... will no longer be valid and any instances assigned to the layer will be destroyed (performing their Destroy Event at the same time, if they have one, as well as the Clean Up Event).
zh_cn: 当你以这种方式破坏一个图层时，它的所有内容也会被删除，所以任何背景或贴图的引用id，等等……将不再有效，任何分配给该层的实例将被销毁(同时执行它们的销毁事件，如果它们有一个，以及清理事件)。

source: When you have "maintain aspect ratio" ticked in the Game Options for a target platform, GameMaker will automatically set the draw position for the application surface so that it is displayed correctly centered and scaled on the given display.
zh_cn: 当您在目标平台的游戏选项中勾选了"保持纵横比"时，GameMaker将自动设置应用程序表面的绘制位置，以便它在给定的显示器上正确居中和缩放显示。

source: When you have a joint with a motor (prismatic or revolute), you may want to be able to switch the motor on or off depending on variables and conditions within the game.
zh_cn: 当你的关节与马达(移动或转动)相连时，你可能希望能够根据游戏中的变量和条件来开关马达。

source: When you pass in an instance ID value, each entry in the array will be a string of the variable name that corresponds to an instance scope variable that has been created in the instance.
zh_cn: 当传入实例ID值时，数组中的每个条目都是变量名的字符串，对应于在实例中创建的实例作用域变量。

source: When you read or write data to a buffer using the buffer_read() or buffer_write() the current "seek" position is advanced by the bytes written or read, and with this function you can get the current "seek" position for use in other buffer functions.
zh_cn: 当您使用buffer_read()或buffer_write()向缓冲区读写数据时，当前的"寻址"位置将根据写入或读取的字节数进行调整，通过此函数，您可以获得当前的"寻址"位置以便在其他缓冲区函数中使用。

source: When you set an animation set for your skeletal animation sprite, it is assigned track 0 internally.
zh_cn: 为骨骼动画精灵设置动画集时，会在内部为其指定轨迹0。

source: When you specify a distance joint the two instances should already be created and have a fixture assigned, then you define the two anchor points in room coordinates.
zh_cn: 指定距离接头时，应该已经创建了两个实例并指定了装置，然后在房间坐标中定义两个定位点。

source: When you start a room with physics, or bind fixtures to instances, the fixtures are always considered to be "awake"... that is to say, they are processing events and interacting with the surrounding instances.
zh_cn: 当你用物理开始一个房间，或将夹具绑定到实例时，夹具总是被认为是"醒着的"……也就是说，它们正在处理事件并与周围的实例交互。

source: When you stop recording, no further Audio Recording Asynchronous Events will be triggered for the given recorder channel, so you would normally use this function in the actual asynchronous event to ensure that you have captured all the data.
zh_cn: 当您停止记录时，将不会为给定的录音机通道触发进一步的音频记录异步事件，因此您通常会在实际的异步事件中使用此函数，以确保您已经捕获了所有数据。

source: When you use this function you need to give one of the following constants which will determine the type of the return value:
zh_cn: 当你使用此函数时，你需要给出以下一个常量来决定返回值的类型:

source: When you use this function, all particles of the given type will disappear from the room and the particle itself is removed form memory, so this function should be used only when you no longer need the particle.
zh_cn: 使用此函数时，所有给定类型的粒子将从房间中消失，并且粒子本身将从内存中删除，因此此函数应仅在您不再需要该粒子时使用。

source: When you use this you are checking a single point in the room for all instances of an object, and the check will be done against the bounding box of the instances or against the mask of the instances if that object has precise collisions checked.
zh_cn: 使用此选项时，您将在房间中的一个点上检查一个对象的所有实例，如果该对象选中了精确碰撞，检查将针对实例的边界框或实例的遮罩进行。

source: When you use this you are checking a single point in the room for an instance or an object.
zh_cn: 当您使用此选项时，您正在检查房间中的某个点是否有实例或对象。

source: When you use this you are effectively asking GameMaker to move the instance to the new position, check for a collision, move back and tell you if a collision was found or not.
zh_cn: 当你使用这个的时候，你实际上是在要求GameMaker将实例移动到新的位置，检查是否有碰撞，返回并告诉你是否发现了碰撞。

source: When you use this you are effectively asking GameMaker to move the instance to the new position, check for a collision, then move back and tell you if a collision was found or not.
zh_cn: 当你使用这个的时候，你实际上是在要求GameMaker将实例移动到新的位置，检查是否有碰撞，然后返回并告诉你是否发现了碰撞。

source: When your game is compiled, it also includes certain internal functions to error check while running.
zh_cn: 当你的游戏被编译时，它还包括一些内部函数，在运行时进行错误检查。

source: Where in the list to delete the value.
zh_cn: 列表中要删除值的位置。

source: Where the GUI is positioned (ie: the (0,0) position) will depend on whether you have used the function display_set_gui_maximise() or not.
zh_cn: GUI的位置(即(0，0)位置)将取决于您是否使用了display_set_gui_maximise()函数。

source: Where the bar is "anchored" (0 = left, 1 = right, 2 = top, 3 = bottom)
zh_cn: 其中栏是"锚定的"(0 =左，1 =右，2 =上，3 =下)

source: Whether automatic drawing is on (true) or not (false).
zh_cn: 自动绘图是否打开 (true) 或关闭 (false)。

source: Whether automatic updating is on (true) or not (false).
zh_cn: 自动更新是否开启(true)或未开启(false)。

source: Whether each texture in the group should be loaded into GPU memory (defaults to true)
zh_cn: 组中的每个纹理是否应该加载到GPU内存中(默认为true)

source: Whether old particles should be drawn behind newer ones (true) or vice versa (false).
zh_cn: 旧粒子是否应该被画在新粒子的后面(true)或相反(false)。

source: Whether the animation should loop (defaults to true).
zh_cn: 动画是否应该循环播放(默认为true)。

source: Whether the bar's background is drawn (true) or not (false).
zh_cn: 是否绘制条形图的背景(true或false)。

source: Whether the bar's elements have a 1px wide black border (true) or not (false).
zh_cn: 条形图的元素是否有1px宽的黑色边框(true或false)。

source: Whether the button is up (true) or down (false)
zh_cn: 按钮是上(true)还是下(false)

source: Whether the calling instance should follow the absolute path as it is in the editor (true) or a relative path to its current position (false).
zh_cn: 调用实例应该遵循编辑器中的绝对路径(true)还是当前位置的相对路径(false)。

source: Whether the calling instance, if relevant, should be excluded (true) or not (false).
zh_cn: 如果相关，是应该排除调用实例(true)还是不排除调用实例(false)。

source: Whether the check is based on pixel-perfect collisions (true = slow) or its bounding box in general (false = fast).
zh_cn: 检查是基于像素完美碰撞(true=慢)还是基于其边界框(false=快)。

source: Whether the check is based on precise collisions (true, which is slower) or its bounding box in general (false, faster).
zh_cn: 检查是基于精确碰撞(true，这比较慢)还是基于它的边界框(false，这比较快)。

source: Whether the circle is an outline (true) or not (false).
zh_cn: 圆是轮廓(true)或不(false)。

source: Whether the circle is drawn filled (false) or as a one pixel wide outline (true).
zh_cn: 画圆是填充的(false)还是一个像素宽的轮廓(true)。

source: Whether the ellipse is an outline (true) or filled in (false).
zh_cn: 椭圆是轮廓(true)还是填充的(false)。

source: Whether the ellipse is drawn filled (false) or as a one pixel wide outline (true).
zh_cn: 椭圆是否绘制为填充(false)或作为一个像素宽的轮廓(true)。

source: Whether the font is bold (true) or not (false).
zh_cn: 字体是粗体(true)还是非粗体(false)。

source: Whether the font is italic (true) or not (false).
zh_cn: 字体是斜体(true)还是非斜体(false)。

source: Whether the instance is interesecting with the boundary of the given view (0 to 7)
zh_cn: 实例是否与给定视图的边界相交(0到7)

source: Whether the instance is intersecting the boundary
zh_cn: 实例是否与边界相交

source: Whether the instance is outside of the room
zh_cn: 实例是否在房间之外

source: Whether the instance is outside the given view (0 to 7)
zh_cn: 实例是否在给定视图之外(0到7)

source: Whether the layer should be visible (true) or not (false)
zh_cn: 该层是否应该可见(true)或不可见(false)

source: Whether the list should be ordered by distance (true) or not (false).
zh_cn: 列表应该按距离排序(true)还是不排序(false)。

source: Whether the match should be complete of partial.
zh_cn: 比赛是否应该是完全的还是部分的。

source: Whether the motor should be active (true) or not (false)
zh_cn: 马达是否应活动(true)或不(false)

source: Whether the object should be flagged as persistent (true) or not (false).
zh_cn: 对象是否应该标记为持久化(true)或非持久化(false)。

source: Whether the particles should be blended additively (true) or normally (false).
zh_cn: 颗粒是否应添加混合(true)或正常混合(false)。

source: Whether the path is closed (true) or not (false).
zh_cn: 路径是闭合的(true)还是不闭合的(false)。

source: Whether the path is drawn at the absolute position (true) or the relative position (false)
zh_cn: 是在绝对位置(true)还是相对位置(false)绘制路径

source: Whether the rectangle is an outline (true) or filled in (false).
zh_cn: 矩形是轮廓(true)还是填充(false)。

source: Whether the rectangle is drawn filled (false) or as a one pixel wide outline (true).
zh_cn: 矩形是填充绘制(false)还是作为一个像素宽的轮廓绘制(true)。

source: Whether the room shall be persistent (true) or not (false).
zh_cn: 房间是否应该持久(true)或不持久(false)。

source: Whether the rounded rectangle is drawn filled (false) or as a one pixel wide outline (true).
zh_cn: 是否绘制圆角矩形填充(false)或作为一个像素宽的轮廓(true)。

source: Whether the to limit the angle of the joint (true) or not (false)
zh_cn: 是否限制关节的角度(true)或不(false)

source: Whether the tracks in the group should loop (true) or not (false).
zh_cn: 组中的轨道是否应该循环(true)或不循环(false)。

source: Whether the triangle is an outline (true) or filled in (false).
zh_cn: 三角形是轮廓(真)还是填充(假)。

source: Whether the triangle is drawn filled (false) or as a one pixel wide outline (true).
zh_cn: 三角形是填充绘制(false)还是作为一个像素宽的轮廓绘制(true)。

source: Whether the two instances can collide (true) or not (false)
zh_cn: 两个实例是否会碰撞 (true) 或不 (false)

source: Whether the values should be ascending (true) or descending (false) order.
zh_cn: 这些值应该是升序(true)还是降序(false)。

source: Whether this should repeat indefinitely
zh_cn: 这种情况是否应该无限重复

source: Whether to abort (true) or not (false).
zh_cn: 是否中止(true)或不中止(false)。

source: Whether to activate instances on the inside of the region (true) or the outside (false).
zh_cn: 是激活区域内部的实例(true)还是激活区域外部的实例(false)。

source: Whether to bypass all effects and gain scaling of the bus.
zh_cn: 是否绕过总线的所有效果和增益缩放。

source: Whether to bypass the effect.
zh_cn: 是否绕过该效果。

source: Whether to check all instances (true) or just solid ones (false).
zh_cn: 是检查所有实例(true)还是只检查实体实例(false)。

source: Whether to check for collisions with all instances (true) or just solid ones (false).
zh_cn: 是检查与所有实例的碰撞(true)还是只检查实体实例的碰撞(false)。

source: Whether to choose a random sub-image (true) or not (false).
zh_cn: 是否选择随机子图像(true)或否(false)。

source: Whether to close the chain (true) or not (false).
zh_cn: 是否关闭链(true)或不(false)

source: Whether to create collision masks for each sub-image of the sprite (true), or one mask for all (false).
zh_cn: 是为精灵的每个子图像创建碰撞掩码(true)，还是为所有子图像创建一个掩码(false)。

source: Whether to deactivate instances on the inside of the region (true) or the outside (false).
zh_cn: 是停用区域内部的实例(true)还是外部的实例(false)。

source: Whether to destroy all of the children of the time source too
zh_cn: 是否也要销毁时间源的所有子级

source: Whether to enable (set to true or disable (set to false) Z depth forcing
zh_cn: 是否启用(设置为true或禁用(设置为false) Z深度强制

source: Whether to enable (true) or disable (false) AA for added fonts.
zh_cn: 此函数可以用来检查使用font_add()添加的字体是否启用了抗锯齿(AA)。

source: Whether to enable (true) or disable (false) SDF rendering for the specified font.
zh_cn: 为指定字体启用 (true) 还是禁用 (false) SDF呈现。

source: Whether to enable (true) or disable (false) views in the given room.
zh_cn: 在给定房间中启用(true)还是禁用(false)视图。

source: Whether to enable advanced bouncing (true) or not (false).
zh_cn: 是否启用高级弹跳(true)或不启用(false)。

source: Whether to exclude the calling instance from deactivation (true) or not (false).
zh_cn: 是否从停用中排除调用实例(true)或不(false)。

source: Whether to filter the results to those that are on your friends list or to all players (see the Description below)
zh_cn: 是将结果过滤到你的好友列表中还是所有玩家(见下面的描述)

source: Whether to follow the sprite's animation normally (true) or not (false).
zh_cn: 是否正常跟随精灵的动画(true)或否(false)。

source: Whether to keep the calling instance activated (true) or not (false).
zh_cn: 是否保持调用实例激活(true)或不激活(false)。

source: Whether to limit the movement of the joint (true) or not (false)
zh_cn: 是否限制关节的运动(true)或不(false)

source: Whether to perform that new object's Create event (true) or not (false).
zh_cn: 是执行新对象的创建事件(true)还是不执行(false)。

source: Whether to perform that new object's create and destroy events (true) or not (false).
zh_cn: 是否执行新对象的创建和销毁事件(true)或不执行(false)。

source: Whether to perform the new instance's Create event (true) or not (false).
zh_cn: 是否执行新实例的Create事件(true)或不执行(false)。

source: Whether to set its angle relative to the direction of the particle's motion (true) or not (false).
zh_cn: 是相对于粒子运动方向设定其角度(true)还是不设定角度(false)。

source: Whether to set the screen to fullscreen (true) or not (false).
zh_cn: 是否将屏幕设置为全屏(true)或不设置(false)。

source: Whether to sort lowest to highest (true), or highest to lowest (false).
zh_cn: 是从最低到最高排序(true)，还是从最高到最低排序(false)。

source: Whether to stretch the sprite's animation to match the particle lifespan (true) or not (false).
zh_cn: 是否扩展精灵的动画以匹配粒子的寿命(true)或否(false)。

source: Whether to wrap horizontally (true) or not (false).
zh_cn: 水平环绕(true)或不(false)。

source: Whether to wrap vertically (true) or not (false).
zh_cn: 垂直环绕(true)或不(false)。

source: Whether white space around each letter should be removed (if false, the created font will be monospaced, otherwise it'll be like most regular fonts).
zh_cn: 是否应该删除每个字母周围的空白(如果为false，创建的字体将是等间距的，否则它将像大多数常规字体一样)。

source: Whether you wish to turn the motor on (true) or off (false)
zh_cn: 您是希望打开马达(true) 或不 (false)

source: Which gamepad "slot" index to check
zh_cn: 要检查哪个手柄"槽位"索引

source: Which gamepad "slot" to check.
zh_cn: 检查哪个游戏手柄"插槽"。

source: Which gamepad "slot" to get the name of.
zh_cn: 游戏手柄"插槽"的名称。

source: Which gamepad button constant to check for.
zh_cn: 检查哪个手柄按钮常量。

source: Which gamepad device "slot" to check.
zh_cn: 检查哪个游戏手柄设备"插槽"。

source: Which gamepad device "slot" to set.
zh_cn: 要设置哪个游戏手柄设备"插槽"。

source: Which gamepad hat (or hats) to check for.
zh_cn: 要检查哪个(哪些)游戏手柄帽。

source: Which gamepad index "slot" to get the mapping from.
zh_cn: 从哪个手柄索引"槽位"获取映射。

source: Which gamepad index "slot" to remove the mapping from.
zh_cn: 从哪个游戏手柄索引"槽"中移除映射。

source: Which gamepad index "slot" to set.
zh_cn: 要设置哪个手柄索引"槽位"。

source: Which keyboard key event should be triggered by touching this area
zh_cn: 触摸该区域应触发哪个键盘按键事件

source: Which mouse button constant to check for.
zh_cn: 要检查哪个鼠标按钮常量。

source: While you can draw these sprites using the normal draw functions (like draw_self()), there are times when you may want to draw a single frame or show a change of skin texture without actually changing the sprite properties for an instance.
zh_cn: 虽然你可以使用普通的绘制函数(如draw_self())绘制这些精灵，但有时你可能想要绘制单个帧或显示皮肤纹理的变化，而不实际更改实例的精灵属性。

source: While you can draw these sprites using the normal draw functions (like draw_self()), there are times when you may want to draw a single frame or show a change of skin texture without actually changing the sprite properties.
zh_cn: 虽然你可以使用普通的绘制函数(如draw_self())绘制这些精灵，但有时你可能想在不实际改变精灵属性的情况下绘制单个帧或显示皮肤纹理的变化。

source: While you can set any view camera using the specific camera_set_* functions, the new settings will not be used for rendering until the next game frame, but with this function you can make those changes immediately.
zh_cn: 虽然您可以使用特定的camera_set_*函数设置任何视图相机，但新设置将不会用于渲染，直到下一个游戏帧，但使用此函数，您可以立即进行这些更改。

source: Windows 10 Universal Windows Platform
zh_cn: Windows 10 通用Windows平台

source: Windows App
zh_cn: Windows应用程序

source: Windows OS
zh_cn: Windows系统

source: With a distance joint, you can get "joint stretching" where the two fixtures will separate and behave strangely should too much stress be put on the joint, however the rope joint does not do this and will not stretch any further than the maximum defined length.
zh_cn: 使用距离连接，你可以得到"连接拉伸"，如果在连接上施加过多的应力，两个夹具将分离，并表现出奇怪的行为，然而绳子连接不会这样做，不会拉伸任何超过最大定义的长度。

source: With mouse input, the mouse button will have to be released and pressed again for any further input to be detected, but with the keyboard it's not quite that simple.
zh_cn: 对于鼠标输入，要检测到任何进一步的输入，必须释放并再次按下鼠标按钮，但对于键盘，这并不那么简单。

source: With skeletal animation sprites, you can assign separate textures (called "skins") to the animation, thereby using one animation for multiple different things.
zh_cn: 使用骨骼动画精灵，可以将单独的纹理(称为"皮肤")指定给动画，从而将一个动画用于多个不同的事情。

source: With the buffer_read() function, you can read data from the given buffer at the current "seek" position, with each piece of data being read advancing this position by the bytes being read or written.
zh_cn: 使用buffer_read()函数，您可以在当前的"seek"位置从给定的缓冲区中读取数据，每读取一段数据，就会将该位置向前推进所读取或写入的字节。

source: With the buffer_write() function, you can write data to the given buffer at the current "seek" position, with each piece of data advancing this position by the bytes being written or read.
zh_cn: 使用buffer_write()函数，您可以将数据写入给定的缓冲区的当前"查找"位置，每一段数据都将此位置向前推进被写入或读取的字节。

source: With this built in array you can get or set the x position of the given view port.
zh_cn: 有了这个内置的数组，你可以获取或设置给定视口的x位置。

source: With this built in array you can get or set the y position of the given view port.
zh_cn: 有了这个内置的数组，你就可以获取或设置给定视口的y位置。

source: With this code you can append one path onto another one, effectively joining them together, and for this to work, both paths must previously exist.
zh_cn: 使用这段代码，您可以将一条路径附加到另一条路径上，有效地将它们连接在一起，要实现这一点，两条路径必须预先存在。

source: With this function we can mark individual cells within the given MP grid as being "forbidden" meaning that the path finding functions will not ever cross them.
zh_cn: 通过此函数，我们可以将给定MP网格内的单个单元标记为"禁止的",这意味着路径查找功能将永远不会跨越它们。

source: With this function you begin the definition of a custom primitive.
zh_cn: 通过此函数，您可以开始定义一个自定义图元。

source: With this function you can "clone" an instance as this will create a new version of the instance running the code at its same position.
zh_cn: 使用此函数，您可以"克隆"一个实例，因为这将创建一个在其相同位置运行代码的实例的新版本。

source: With this function you can "lock" your device to the current orientation until such time as you "free" it to allow all Game Options enabled orientations again for that target platform.
zh_cn: 通过此函数，您可以将您的设备"锁定"到当前方向，直到您"释放"它以允许该目标平台的所有游戏选项再次启用方向。

source: With this function you can "reset" a particle, returning all the values for each of the functions relating to the particle (life, colour, alpha, orientation etc...) to their default values.
zh_cn: 使用此函数，你可以"重置"一个粒子，返回与粒子相关的每个函数的所有值(寿命、颜色、alpha、方向等)到它们的默认值。

source: With this function you can activate a layer that has been deactivated previously.
zh_cn: 通过此函数，你可以激活一个之前被停用的层。

source: With this function you can activate a single instance or all instances of a specific object from all those that have been deactivated previously.
zh_cn: 通过此函数，您可以从以前已停用的所有实例中激活特定对象的单个实例或所有实例。

source: With this function you can add a name and a score to the internal global high score list.
zh_cn: 通过此函数，您可以向内部全局高分列表添加姓名和分数。

source: With this function you can add a new (empty) time line into your game.
zh_cn: 通过此函数，你可以添加一个新的(空)时间线到你的游戏。

source: With this function you can add a point to the specified path and set its speed factor.
zh_cn: 通过此函数，您可以向指定路径添加一个点，并设置其速度乘数。

source: With this function you can add a value (either a real number or a string) to a priority queue, at the same time assigning it a priority value.
zh_cn: 使用此函数，您可以向优先队列添加一个值(实数或字符串)，同时为其分配一个优先值。

source: With this function you can add an image as a sprite, loading it from an external source where the image file to be loaded should always be in either *.png, *.gif, *.jpg/jpeg or *.json format (*json files are used for loading skeleton animation sprites made with Spine).
zh_cn: 通过此函数，您可以将图像添加为精灵，从外部源加载图像，加载的图像文件应该总是*.png, *.gif, *.jpg/jpeg or *.json格式(*json文件用于加载用Spine制作的骨骼动画精灵)。

source: With this function you can add an instance into any room other than the current one and at any position within that room.
zh_cn: 通过此函数，您可以将实例添加到除当前房间之外的任何房间以及该房间内的任何位置。

source: With this function you can add one or more tag strings to any asset from the asset browser.
zh_cn: 使用此函数，您可以从资源浏览器向任何资源添加一个或多个标记字符串。

source: With this function you can assign a (previously created) DS list to a key within the given DS map.
zh_cn: 使用此函数，您可以将(先前创建的)DS list分配给给定DS map中的键。

source: With this function you can assign a (previously created) DS map to a key within the given DS map .
zh_cn: 通过此函数，您可以将(之前创建的)DS map分配给给定DS map中的键。

source: With this function you can assign a camera to a specific viewport in a room other than the current one.
zh_cn: 通过此函数，您可以将相机指定给房间中的特定视口，而不是当前视口。

source: With this function you can assign a script function to a layer and it will be called after the layer is rendered.
zh_cn: 通过此函数，你可以给一个图层分配一个脚本函数，它会在图层渲染后被调用。

source: With this function you can assign a script function to a layer and it will be called before the layer is rendered.
zh_cn: 使用此函数，你可以给一个层分配一个脚本函数，它将在层被渲染之前被调用。

source: With this function you can assign a shader resource to any given layer and the layer will then be rendered using that shader.
zh_cn: 通过此函数，你可以给任何给定的层分配一个着色器资源，然后该层将使用该着色器渲染。

source: With this function you can assign a sound to a previously create sync group.
zh_cn: 通过此函数，您可以将声音分配到之前创建的同步组。

source: With this function you can assign a sprite resource to a layer to be used as a background in your project.
zh_cn: 通过此函数，您可以将精灵资源分配给一个层，用作项目中的背景。

source: With this function you can assign a sprite resource to a layer to be used in your project.
zh_cn: 通过此函数，你可以将精灵资源分配到你的项目中使用的层。

source: With this function you can assign a tile-set resource to a layer to be used as a tile map in your project.
zh_cn: 通过此函数，您可以将切片集资源分配给要在项目中用作tile map的图层。

source: With this function you can bind any function that has previously been defined to a given instance or struct, creating a method variable that can be used later.
zh_cn: 使用此函数，您可以将以前定义的任何函数绑定到给定的实例或结构，创建一个可以在以后使用的方法变量。

source: With this function you can broadcast the data from a buffer locally to a range of IP addresses (for more information on buffers see Reference - Buffers).
zh_cn: 通过此函数，您可以从缓冲区本地广播数据到一系列IP地址(有关缓冲区的更多信息，请参阅参考-缓冲区)。

source: With this function you can center the game window in the display when the target module is Windows, Ubuntu (Linux) or macOS, or you can center it in the browser if the target module is HTML5.
zh_cn: 通过此函数，当目标模块是Windows、Ubuntu (Linux)或macOS时，您可以将游戏窗口置于显示屏的中央，或者如果目标模块是HTML5，您可以将其置于浏览器的中央。

source: With this function you can change (or set) the height of any room in your game except the current one.
zh_cn: 通过此函数，您可以更改(或设置)游戏中除当前房间之外的任何房间的高度。

source: With this function you can change (or set) the persistence of any room in your game except the current one.
zh_cn: 通过此函数，您可以更改(或设置)游戏中除当前房间之外的任何房间的持久性。

source: With this function you can change (or set) the width of any room in your game except the current one.
zh_cn: 通过此函数，您可以更改(或设置)游戏中除当前房间之外的任何房间的宽度。

source: With this function you can change or set the position of the mouse within the game display which can be useful for FPS games, for example.
zh_cn: 通过此函数，您可以更改或设置鼠标在游戏显示中的位置，这对于FPS游戏非常有用。

source: With this function you can change or set the position of the mouse within the game window which can be useful for FPS games, for example.
zh_cn: 通过此函数，你可以在游戏窗口中改变或设置鼠标的位置，这对于FPS游戏来说非常有用。

source: With this function you can change or set the windows caption for the room that you are currently in.
zh_cn: 通过此函数，您可以更改或设置您当前所在房间的窗口标题。

source: With this function you can change the "smoothness" of a path.
zh_cn: 通过此函数，您可以更改路径的"平滑度"。

source: With this function you can change the group flags for a group of particles.
zh_cn: 通过此函数，您可以更改一组粒子的组标志。

source: With this function you can change the orientation of the given listener within the 3D audio space.
zh_cn: 通过此函数，您可以在3D音频空间中改变给定侦听器的方向。

source: With this function you can change the orientation of the listener within the 3D audio space.
zh_cn: 通过此函数，您可以在3D音频空间内改变侦听器的方向。

source: With this function you can change the particle flags for a category of particles.
zh_cn: 使用此函数，您可以更改粒子类别的粒子标志。

source: With this function you can change the particle flags for an individual particle.
zh_cn: 使用此函数，您可以更改单个粒子的粒子标志。
